Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_uarte.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; nrf5340_network_uarte.
; ======================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     nrf5340_network_uarte equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// UARTE address definitions
// -------------------------

typedef struct {
    volatile    uint32_t    TASKS_STARTRX;
    volatile    uint32_t    TASKS_STOPRX;
    volatile    uint32_t    TASKS_STARTTX;
    volatile    uint32_t    TASKS_STOPTX;
    volatile    uint32_t    RESERVED0[7];
    volatile    uint32_t    TASKS_FLUSHRX;
    volatile    uint32_t    RESERVED1[20];
    volatile    uint32_t    SUBSCRIBE_STARTRX;
    volatile    uint32_t    SUBSCRIBE_STOPRX;
    volatile    uint32_t    SUBSCRIBE_STARTTX;
    volatile    uint32_t    SUBSCRIBE_STOPTX;
    volatile    uint32_t    RESERVED2[7];
    volatile    uint32_t    SUBSCRIBE_FLUSHRX;
    volatile    uint32_t    RESERVED3[20];
    volatile    uint32_t    EVENTS_CTS;
    volatile    uint32_t    EVENTS_NCTS;
    volatile    uint32_t    EVENTS_RXDRDY;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    EVENTS_ENDRX;
    volatile    uint32_t    RESERVED5[2];
    volatile    uint32_t    EVENTS_TXDRDY;
    volatile    uint32_t    EVENTS_ENDTX;
    volatile    uint32_t    EVENTS_ERROR;
    volatile    uint32_t    RESERVED6[7];
    volatile    uint32_t    EVENTS_RXTO;
    volatile    uint32_t    RESERVED7;
    volatile    uint32_t    EVENTS_RXSTARTED;
    volatile    uint32_t    EVENTS_TXSTARTED;
    volatile    uint32_t    RESERVED8;
    volatile    uint32_t    EVENTS_TXSTOPPED;
    volatile    uint32_t    RESERVED9[9];
    volatile    uint32_t    PUBLISH_CTS;
    volatile    uint32_t    PUBLISH_NCTS;
    volatile    uint32_t    PUBLISH_RXDRDY;
    volatile    uint32_t    RESERVED10;
    volatile    uint32_t    PUBLISH_ENDRX;
    volatile    uint32_t    RESERVED11[2];
    volatile    uint32_t    PUBLISH_TXDRDY;
    volatile    uint32_t    PUBLISH_ENDTX;
    volatile    uint32_t    PUBLISH_ERROR;
    volatile    uint32_t    RESERVED12[7];
    volatile    uint32_t    PUBLISH_RXTO;
    volatile    uint32_t    RESERVED13;
    volatile    uint32_t    PUBLISH_RXSTARTED;
    volatile    uint32_t    PUBLISH_TXSTARTED;
    volatile    uint32_t    RESERVED14;
    volatile    uint32_t    PUBLISH_TXSTOPPED;
    volatile    uint32_t    RESERVED15[9];
    volatile    uint32_t    SHORTS;
    volatile    uint32_t    RESERVED16[63];
    volatile    uint32_t    INTEN;
    volatile    uint32_t    INTENSET;
    volatile    uint32_t    INTENCLR;
    volatile    uint32_t    RESERVED17[93];
    volatile    uint32_t    ERRORSRC;
    volatile    uint32_t    RESERVED18[31];
    volatile    uint32_t    ENABLE;
    volatile    uint32_t    RESERVED19;
    volatile    uint32_t    PSEL_RTS;
    volatile    uint32_t    PSEL_TXD;
    volatile    uint32_t    PSEL_CTS;
    volatile    uint32_t    PSEL_RXD;
    volatile    uint32_t    RESERVED20[3];
    volatile    uint32_t    BAUDRATE;
    volatile    uint32_t    RESERVED21[3];
    volatile    uint32_t    RXD_PTR;
    volatile    uint32_t    RXD_MAXCNT;
    volatile    uint32_t    RXD_AMOUNT;
    volatile    uint32_t    RESERVED22;
    volatile    uint32_t    TXD_PTR;
    volatile    uint32_t    TXD_MAXCNT;
    volatile    uint32_t    TXD_AMOUNT;
    volatile    uint32_t    RESERVED23[7];
    volatile    uint32_t    CONFIG;
} UARTE_TypeDef;

#ifdef __cplusplus
#define UARTE0_NS   reinterpret_cast<UARTE_TypeDef *>(0x41013000u)

#else
#define UARTE0_NS   ((UARTE_TypeDef *)0x41013000u)
#endif

// TASKS_STARTRX Configuration

#define UARTE_TASKS_STARTRX_TASKS_STARTRX                       (0x1u<<0)
#define UARTE_TASKS_STARTRX_TASKS_STARTRX_TRIGGER               (0x1u<<0)

// TASKS_STOPRX Configuration

#define UARTE_TASKS_STOPRX_TASKS_STOPRX                         (0x1u<<0)
#define UARTE_TASKS_STOPRX_TASKS_STOPRX_TRIGGER                 (0x1u<<0)

// TASKS_STARTTX Configuration

#define UARTE_TASKS_STARTTX_TASKS_STARTTX                       (0x1u<<0)
#define UARTE_TASKS_STARTTX_TASKS_STARTTX_TRIGGER               (0x1u<<0)

// TASKS_STOPTX Configuration

#define UARTE_TASKS_STOPTX_TASKS_STOPTX                         (0x1u<<0)
#define UARTE_TASKS_STOPTX_TASKS_STOPTX_TRIGGER                 (0x1u<<0)

// TASKS_FLUSHRX Configuration

#define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX                       (0x1u<<0)
#define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_TRIGGER               (0x1u<<0)

