Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_uarte.h
// ERRORSRC Configuration

#define UARTE_ERRORSRC_BREAK                                    (0x1u<<3)
#define UARTE_ERRORSRC_FRAMING                                  (0x1u<<2)
#define UARTE_ERRORSRC_PARITY                                   (0x1u<<1)
#define UARTE_ERRORSRC_OVERRUN                                  (0x1u<<0)
#define UARTE_ERRORSRC_BREAK_NOTPRESENT                         (0x0u<<3)
#define UARTE_ERRORSRC_BREAK_PRESENT                            (0x1u<<3)
#define UARTE_ERRORSRC_FRAMING_NOTPRESENT                       (0x0u<<2)
#define UARTE_ERRORSRC_FRAMING_PRESENT                          (0x1u<<2)
#define UARTE_ERRORSRC_PARITY_NOTPRESENT                        (0x0u<<1)
#define UARTE_ERRORSRC_PARITY_PRESENT                           (0x1u<<1)
#define UARTE_ERRORSRC_OVERRUN_NOTPRESENT                       (0x0u<<0)
#define UARTE_ERRORSRC_OVERRUN_PRESENT                          (0x1u<<0)

// ENABLE Configuration

#define UARTE_ENABLE_ENABLE                                     (0xFu<<0)
#define UARTE_ENABLE_ENABLE_0                                   (0x1u<<0)
#define UARTE_ENABLE_ENABLE_DISABLED                            (0x0u<<0)
#define UARTE_ENABLE_ENABLE_ENABLED                             (0x8u<<0)

// RTS Configuration

#define UARTE_PSEL_RTS_CONNECT                                  (0x1u<<31)
#define UARTE_PSEL_RTS_PORT                                     (0x1u<<5)
#define UARTE_PSEL_RTS_PIN                                      (0x1Fu<<0)
#define UARTE_PSEL_RTS_PIN_0                                    (0x1u<<0)
#define UARTE_PSEL_RTS_CONNECT_DISCONNECTED                     (0x1u<<31)
#define UARTE_PSEL_RTS_CONNECT_CONNECTED                        (0x0u<<31)

// TXD Configuration

#define UARTE_PSEL_TXD_CONNECT                                  (0x1u<<31)
#define UARTE_PSEL_TXD_PORT                                     (0x1u<<5)
#define UARTE_PSEL_TXD_PIN                                      (0x1Fu<<0)
#define UARTE_PSEL_TXD_PIN_0                                    (0x1u<<0)
#define UARTE_PSEL_TXD_CONNECT_DISCONNECTED                     (0x1u<<31)
#define UARTE_PSEL_TXD_CONNECT_CONNECTED                        (0x0u<<31)

// CTS Configuration

#define UARTE_PSEL_CTS_CONNECT                                  (0x1u<<31)
#define UARTE_PSEL_CTS_PORT                                     (0x1u<<5)
#define UARTE_PSEL_CTS_PIN                                      (0x1Fu<<0)
#define UARTE_PSEL_CTS_PIN_0                                    (0x1u<<0)
#define UARTE_PSEL_CTS_CONNECT_DISCONNECTED                     (0x1u<<31)
#define UARTE_PSEL_CTS_CONNECT_CONNECTED                        (0x0u<<31)

// RXD Configuration

#define UARTE_PSEL_RXD_CONNECT                                  (0x1u<<31)
#define UARTE_PSEL_RXD_PORT                                     (0x1u<<5)
#define UARTE_PSEL_RXD_PIN                                      (0x1Fu<<0)
#define UARTE_PSEL_RXD_PIN_0                                    (0x1u<<0)
#define UARTE_PSEL_RXD_CONNECT_DISCONNECTED                     (0x1u<<31)
#define UARTE_PSEL_RXD_CONNECT_CONNECTED                        (0x0u<<31)

// BAUDRATE Configuration

#define UARTE_BAUDRATE_BAUDRATE                                 (0xFFFFFFFFu<<0)
#define UARTE_BAUDRATE_BAUDRATE_0                               (0x1u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD1200                        (0x4F000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD2400                        (0x9D000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD4800                        (0x13B000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD9600                        (0x275000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD14400                       (0x3AF000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD19200                       (0x4EA000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD28800                       (0x75C000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD31250                       (0x800000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD38400                       (0x9D0000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD56000                       (0xE50000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD57600                       (0xEB0000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD76800                       (0x13A9000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD115200                      (0x1D60000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD230400                      (0x3B00000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD250000                      (0x4000000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD460800                      (0x7400000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD921600                      (0xF000000u<<0)
#define UARTE_BAUDRATE_BAUDRATE_BAUD1M                          (0x10000000u<<0)

// PTR Configuration

#define UARTE_RXD_PTR_PTR                                       (0xFFFFFFFFu<<0)
#define UARTE_RXD_PTR_PTR_0                                     (0x1u<<0)

// MAXCNT Configuration

#define UARTE_RXD_MAXCNT_MAXCNT                                 (0xFFFFu<<0)
#define UARTE_RXD_MAXCNT_MAXCNT_0                               (0x1u<<0)

// AMOUNT Configuration

#define UARTE_RXD_AMOUNT_AMOUNT                                 (0xFFFFu<<0)
#define UARTE_RXD_AMOUNT_AMOUNT_0                               (0x1u<<0)

// PTR Configuration

#define UARTE_TXD_PTR_PTR                                       (0xFFFFFFFFu<<0)
#define UARTE_TXD_PTR_PTR_0                                     (0x1u<<0)

// MAXCNT Configuration

#define UARTE_TXD_MAXCNT_MAXCNT                                 (0xFFFFu<<0)
#define UARTE_TXD_MAXCNT_MAXCNT_0                               (0x1u<<0)

// AMOUNT Configuration

#define UARTE_TXD_AMOUNT_AMOUNT                                 (0xFFFFu<<0)
#define UARTE_TXD_AMOUNT_AMOUNT_0                               (0x1u<<0)

// CONFIG Configuration

#define UARTE_CONFIG_PARITYTYPE                                 (0x1u<<8)
#define UARTE_CONFIG_STOP                                       (0x1u<<4)
#define UARTE_CONFIG_PARITY                                     (0x7u<<1)
#define UARTE_CONFIG_PARITY_0                                   (0x1u<<1)
#define UARTE_CONFIG_HWFC                                       (0x1u<<0)
#define UARTE_CONFIG_PARITYTYPE_EVEN                            (0x0u<<8)
#define UARTE_CONFIG_PARITYTYPE_ODD                             (0x1u<<8)
#define UARTE_CONFIG_STOP_ONE                                   (0x0u<<4)
#define UARTE_CONFIG_STOP_TWO                                   (0x1u<<4)
#define UARTE_CONFIG_PARITY_EXCLUDED                            (0x0u<<1)
#define UARTE_CONFIG_PARITY_INCLUDED                            (0x7u<<1)
#define UARTE_CONFIG_HWFC_DISABLED                              (0x0u<<0)
#define UARTE_CONFIG_HWFC_ENABLED                               (0x1u<<0)
